In [ ]:
import pandas as pd

In [ ]:
flat_data = pd.read_csv('flat_data.csv')

In [130]:
flat_data

   first_name last_name  salary  dept_name  salary_increment
0      Darius   Mufutau    3901    Finance                10
1       Tiger   Elliott    5489         IT                15
2       Malik  Macaulay    5444      Sales                17
3         Ali     Vance    8993  Marketing                16
4     Randall    Deacon    9515         IT                15
5      Josiah       Lee    8113      Sales                17
6       Dante  Mohammad    8446      Sales                17
7       Wyatt     Kuame    4817  Marketing                16
8       Quinn    Oliver    5513    Finance                10
9      Oliver      Gary    5158         IT                15
10      Thane    Phelan    4957      Sales                17
11     Walter    Lester    3864    Finance                10
12     Samson     Dolan    6855         IT                15
13       Beck    Walker    7077      Sales                17
14      Lucas  Marshall    7499  Marketing                16
15       John      Nash    4269         IT                15
16    Quinlan   Elliott    7503      Sales                17
17       Ivan    Dennis    4048      Sales                17
18       Wang     Ronan    9319  Marketing                16
19      Stone   Jameson    9354    Finance                10
20    Clayton    Jarrod    4102         IT                15
21       Cain      Sean    7353      Sales                17

In [ ]:
#create employee and department dataframe

In [ ]:
flat_data = flat_data.rename(columns={'salary_increment ': 'salary_increment'})

In [ ]:
dept_df = flat_data[["dept_name","salary_increment"]]

In [ ]:
dept_df = dept_df.drop_duplicates()

In [ ]:
dept_df.insert(0, 'id', range(1, 1 + len(dept_df)))

In [129]:
dept_df

   id       name  salary_increment
0   1    Finance                10
1   2         IT                15
2   3      Sales                17
3   4  Marketing                16

In [ ]:
dept_df = dept_df.rename(columns={'dept_name':'name'})

In [ ]:
dept_df

In [ ]:
emp_df = flat_data[['first_name','last_name','salary','dept_name']]

In [ ]:
emp_df.insert(0, 'id', range(1, 1 + len(emp_df)))

In [ ]:
emp_df

In [ ]:
def f(row):
    if row['dept_name'] == 'Finance':
        val = 1
    elif row['dept_name'] == 'IT':
        val = 2
    elif row['dept_name'] == 'Sales':
        val = 3
    else:
        val = 4
    return val

In [ ]:
emp_df['department_id'] = emp_df.apply(f, axis=1)

In [ ]:
del emp_df['dept_name']

In [128]:
emp_df

    id first_name last_name  salary  department_id
0    1     Darius   Mufutau    3901              1
1    2      Tiger   Elliott    5489              2
2    3      Malik  Macaulay    5444              3
3    4        Ali     Vance    8993              4
4    5    Randall    Deacon    9515              2
5    6     Josiah       Lee    8113              3
6    7      Dante  Mohammad    8446              3
7    8      Wyatt     Kuame    4817              4
8    9      Quinn    Oliver    5513              1
9   10     Oliver      Gary    5158              2
10  11      Thane    Phelan    4957              3
11  12     Walter    Lester    3864              1
12  13     Samson     Dolan    6855              2
13  14       Beck    Walker    7077              3
14  15      Lucas  Marshall    7499              4
15  16       John      Nash    4269              2
16  17    Quinlan   Elliott    7503              3
17  18       Ivan    Dennis    4048              3
18  19       Wang     Ronan    9319              4
19  20      Stone   Jameson    9354              1
20  21    Clayton    Jarrod    4102              2
21  22       Cain      Sean    7353              3

In [ ]:
pip install pymysql

In [ ]:
pip install mysqlclient

In [ ]:
import sqlalchemy
import pymysql

In [ ]:
engine = sqlalchemy.create_engine('mysql://root:root@localhost')
engine.execute("CREATE DATABASE flatdata")
engine.execute("USE flatdata")

In [ ]:
connection = pymysql.connect(host='localhost',
                         user='root',
                         password='root',
                         db='flatdata')    


cursor=connection.cursor()

In [ ]:
dept_df.to_sql('department', engine, if_exists='append', index=False)

In [ ]:
emp_df.to_sql('employee', engine, if_exists='append', index=False)

In [125]:
sql = "SELECT * FROM employee"
cursor.execute(sql)

result = cursor.fetchall()
for i in result:
    print(i)

(1, 'Darius', 'Mufutau', 3901, 1)
(2, 'Tiger', 'Elliott', 5489, 2)
(3, 'Malik', 'Macaulay', 5444, 3)
(4, 'Ali', 'Vance', 8993, 4)
(5, 'Randall', 'Deacon', 9515, 2)
(6, 'Josiah', 'Lee', 8113, 3)
(7, 'Dante', 'Mohammad', 8446, 3)
(8, 'Wyatt', 'Kuame', 4817, 4)
(9, 'Quinn', 'Oliver', 5513, 1)
(10, 'Oliver', 'Gary', 5158, 2)
(11, 'Thane', 'Phelan', 4957, 3)
(12, 'Walter', 'Lester', 3864, 1)
(13, 'Samson', 'Dolan', 6855, 2)
(14, 'Beck', 'Walker', 7077, 3)
(15, 'Lucas', 'Marshall', 7499, 4)
(16, 'John', 'Nash', 4269, 2)
(17, 'Quinlan', 'Elliott', 7503, 3)
(18, 'Ivan', 'Dennis', 4048, 3)
(19, 'Wang', 'Ronan', 9319, 4)
(20, 'Stone', 'Jameson', 9354, 1)
(21, 'Clayton', 'Jarrod', 4102, 2)
(22, 'Cain', 'Sean', 7353, 3)

In [124]:
sql = "SELECT * FROM department"
cursor.execute(sql)

result = cursor.fetchall()
for i in result:
    print(i)

(1, 'Finance', 10)
(2, 'IT', 15)
(3, 'Sales', 17)
(4, 'Marketing', 16)

In [120]:
sqlquery = "ALTER TABLE `flatdata`.`employee` CHANGE COLUMN `id` `id` INT NOT NULL ,ADD PRIMARY KEY (`id`);"
cursor.execute(sqlquery)

0

In [121]:
sqlquery = "ALTER TABLE `flatdata`.`department` CHANGE COLUMN `id` `id` INT NOT NULL ,ADD PRIMARY KEY (`id`);"
cursor.execute(sqlquery)

0

In [ ]:
sqlquery = "ALTER TABLE `flatdata`.`employee` ADD INDEX `dept_id_fk_idx` (`department_id` ASC) VISIBLE;"
cursor.execute(sqlquery)

In [122]:
sqlquery = "ALTER TABLE `flatdata`.`employee` ADD CONSTRAINT `dept_id_fk_idx`  FOREIGN KEY (`department_id`)  REFERENCES `flatdata`.`department` (`id`)  ON DELETE NO ACTION  ON UPDATE NO ACTION;"
cursor.execute(sqlquery)

22

In [123]:
sqlquery = "CREATE TABLE updated_salaries AS select e.id, (e.salary*d.salary_increment/100 + e.salary) as updated_salary from employee e inner join department d on e.department_id=d.id order by e.id;"
cursor.execute(sqlquery)

22

In [126]:
sql = "SELECT * FROM updated_salaries"
cursor.execute(sql)

result = cursor.fetchall()
for i in result:
    print(i)

(1, Decimal('4291.1000'))
(2, Decimal('6312.3500'))
(3, Decimal('6369.4800'))
(4, Decimal('10431.8800'))
(5, Decimal('10942.2500'))
(6, Decimal('9492.2100'))
(7, Decimal('9881.8200'))
(8, Decimal('5587.7200'))
(9, Decimal('6064.3000'))
(10, Decimal('5931.7000'))
(11, Decimal('5799.6900'))
(12, Decimal('4250.4000'))
(13, Decimal('7883.2500'))
(14, Decimal('8280.0900'))
(15, Decimal('8698.8400'))
(16, Decimal('4909.3500'))
(17, Decimal('8778.5100'))
(18, Decimal('4736.1600'))
(19, Decimal('10810.0400'))
(20, Decimal('10289.4000'))
(21, Decimal('4717.3000'))
(22, Decimal('8603.0100'))

In [127]:
engine.dispose()
connection.close()